def print_val(val):
    res = None
    dict_val = {
        1: 'один',
        2: 'два',
        3: 'три',
        4: 'четыре',
        5: 'пять',
        6: 'шесть',
        7: 'семь',
        8: 'восемь',
        9: 'девять',
        10: 'десять',
        11: 'одиннадцать',
        12: 'двенадцать',
        13: 'тринадцать',
        14: 'четырнадцать',
        15: 'пятнадцать',
        16: 'шестнадцать',
        17: 'семнадцать',
        18: 'восемнадцать',
        19: 'девятнадцать',
        20: 'двадцать',
        30: 'тридцать',
        40: 'сорок',
        50: 'пятьдесят',
        60: 'шестьдесят',
        70: 'семьдесят',
        80: 'восемьдесят',
        90: 'девяносто'
    }
    if (val in dict_val):
        res = dict_val[val]
    else:
        res = dict_val[val // 10 * 10] + ' ' + dict_val[val % 10]
    return res

def main():
    val = int(input('Ввод: '))
    print(f'Вывод: {print_val(val)}')

main()