dict_value = {
    'ноль': 0,
    'один': 1,
    'два': 2,
    'три': 3,
    'четыре': 4,
    'пять': 5,
    'шесть': 6,
    'семь': 7,
    'восемь': 8,
    'девять': 9
}
print('Ввод:')
str_1 = input('    ')
val_1 = dict_value[str_1.lower()]
str_2 = input('    ')
val_2 = dict_value[str_2.lower()]
val_sum = val_1 + val_2
list_sum = [
    0, 'ноль',
    1, 'один',
    2, 'два',
    3, 'три',
    4, 'четыре',
    5, 'пять',
    6, 'шесть',
    7, 'семь',
    8, 'восемь',
    9, 'девять',
    10, 'десять',
    11, 'одиннадцать',
    12, 'двенадцать',
    13, 'тринадцать',
    14, 'четырнадцать',
    15, 'пятнадцать',
    16, 'шестнадцать',
    17, 'семнадцать',
    18, 'восемнадцать'
]
print('Вывод:')
print(f'    {list_sum[list_sum.index(val_sum) + 1]}')